app/controllers/messages_controller.rb

SELECT * FROM "messages"
---
  def index
    @messages = Message.all

INSERT INTO "messages" ("created_at", "updated_at", "content") VALUES('2010-10-06 16:32:10', '2010-10-06 16:32:10', 'dsfdsfdsf')
---
  def create
    @message = Message.new(params[:message])
    if @message.save!